In [9]:
#Install Java first if not pre-installed
#Import module to convert pdf to another format
#Therefore import the read_pdf from tablula 
import tabula
from tabula import read_pdf
import pandas as pd


#Read the pdf file with the read_pdf() method 
df = tabula.read_pdf(r"C:\Users\CJM\Data Analysis with Python and MS Excel\16.8.2023.pdf", pages = 1)[0]

#Return dataframe to excel spreadsheet
df.to_excel('AugData.xlsx')
display(df)

#Give a message when completed
print("Data has been sent to AugData.xlsx")

   DATE: 16-Aug-23 To 16-Aug-23  Unnamed: 0 All Customer's Transaction
0     Customer Name Total Items         NaN               Total Amount
1           Christiana Kwaako 1         NaN                      60.00
2         Edward & Dora Awuku 7         NaN                   1,320.00
3           Elizabeth Kosipah 3         NaN                     620.00
4           Florence Huisinga 1         NaN                      60.00
5               Georgina Sika 3         NaN                     640.00
6              Joesph & Mavis 4         NaN                     980.00
7             Lucy & Hilliard 3         NaN                     840.00
8          Mary Adu Kudzordzi 4         NaN                     960.00
9            Patience Nuworku 1         NaN                      60.00
10              GRAND TOTAL GH¢         NaN                   5,540.00

Data has been sent to AugData.xlsx

In [10]:
from tabulate import tabulate

In [11]:
#Displaying the DataFrame in a SQL style format
print(tabulate(df, headers = 'keys', tablefmt = 'psql'))

+----+--------------------------------+--------------+------------------------------+
|    | DATE: 16-Aug-23 To 16-Aug-23   |   Unnamed: 0 | All Customer's Transaction   |
|----+--------------------------------+--------------+------------------------------|
|  0 | Customer Name Total Items      |          nan | Total Amount                 |
|  1 | Christiana Kwaako 1            |          nan | 60.00                        |
|  2 | Edward & Dora Awuku 7          |          nan | 1,320.00                     |
|  3 | Elizabeth Kosipah 3            |          nan | 620.00                       |
|  4 | Florence Huisinga 1            |          nan | 60.00                        |
|  5 | Georgina Sika 3                |          nan | 640.00                       |
|  6 | Joesph & Mavis 4               |          nan | 980.00                       |
|  7 | Lucy & Hilliard 3              |          nan | 840.00                       |
|  8 | Mary Adu Kudzordzi 4           |          nan | 960.00                       |
|  9 | Patience Nuworku 1             |          nan | 60.00                        |
| 10 | GRAND TOTAL GH¢                |          nan | 5,540.00                     |
+----+--------------------------------+--------------+------------------------------+

In [129]:
# Use DataFrame.iloc[] to drop first row
df.columns = ['Name', 'Amount']
df1 = df.iloc[1:]

#Printing the 1st table with the removed column
#Printing a 2nd table with the first row removed
print(tabulate(df, headers = 'keys', tablefmt = 'psql'))
print(tabulate(df1, headers = 'keys', tablefmt = 'psql'))

+----+---------------------------+--------------+
|    | Name                      | Amount       |
|----+---------------------------+--------------|
|  0 | Customer Name Total Items | Total Amount |
|  1 | Christiana Kwaako 1       | 60.00        |
|  2 | Edward & Dora Awuku 7     | 1,320.00     |
|  3 | Elizabeth Kosipah 3       | 620.00       |
|  4 | Florence Huisinga 1       | 60.00        |
|  5 | Georgina Sika 3           | 640.00       |
|  6 | Joesph & Mavis 4          | 980.00       |
|  7 | Lucy & Hilliard 3         | 840.00       |
|  8 | Mary Adu Kudzordzi 4      | 960.00       |
|  9 | Patience Nuworku 1        | 60.00        |
| 10 | GRAND TOTAL GH¢           | 5,540.00     |
+----+---------------------------+--------------+
+----+-----------------------+----------+
|    | Name                  | Amount   |
|----+-----------------------+----------|
|  1 | Christiana Kwaako 1   | 60.00    |
|  2 | Edward & Dora Awuku 7 | 1,320.00 |
|  3 | Elizabeth Kosipah 3   | 620.00   |
|  4 | Florence Huisinga 1   | 60.00    |
|  5 | Georgina Sika 3       | 640.00   |
|  6 | Joesph & Mavis 4      | 980.00   |
|  7 | Lucy & Hilliard 3     | 840.00   |
|  8 | Mary Adu Kudzordzi 4  | 960.00   |
|  9 | Patience Nuworku 1    | 60.00    |
| 10 | GRAND TOTAL GH¢       | 5,540.00 |
+----+-----------------------+----------+

In [76]:
#1st coding convention for a statistical description.
df1.describe(include=["object", "int"])

                       Name Amount
count                    10     10
unique                   10      8
top     Christiana Kwaako 1  60.00
freq                      1      3

In [85]:
#2nd coding convention for a statistical description
df1[["Name", "Amount"]].describe()

                       Name Amount
count                    10     10
unique                   10      8
top     Christiana Kwaako 1  60.00
freq                      1      3